Revit 2027 API
FamilyInstance.IsWorkPlaneFlipped Property
Identifies if the instance's work plane is flipped.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsWorkPlaneFlipped { get; set; }
Public Property IsWorkPlaneFlipped As Boolean
	Get
	Set
public:
property bool IsWorkPlaneFlipped {
	bool get ();
	void set (bool value);
}
member IsWorkPlaneFlipped : bool with get, set
Property Value
Boolean
Exceptions
Exception | Condition
InapplicableDataException |  Work plane cannot be flipped for this instance.
See Also
Reference
FamilyInstance Class
Autodesk.Revit.DB Namespace